<p><font size="5"><b>CRIMES ET DELITS EN FRANCE - SIMPLON DEV. DATA </b></font></p>


<p><font size="4"><b> 3-3. PRÉPARATION DONNÉES POUR IMPORT DANS SQL - ASSEMBLAGE GENDARMERIE & POLICE </b></font></p>

<p><font size="3"> *SOURCE DATASET : https://www.data.gouv.fr/fr/datasets/crimes-et-delits-enregistres-par-les-services-de-gendarmerie-et-de-police-depuis-2012/* </font></p>

*© 2020, Gérald Bouget  (<mailto:geraldbouget@gmail.com>)

In [3]:
import pandas as pd
import openpyxl
import os
#imac:
#os.chdir('/Users/admin/SFR Cloud/Documents/Simplon_DataDev_formation/Projet_final/Datasets/crimes_delits_police_gendarmerie_annuel/')

#macbookpro:
os.chdir('/Users/geraldbouget/SFR Cloud/Documents/Simplon_DataDev_formation/Projet_final/Datasets/crimes_delits_police_gendarmerie_annuel/')

## <div class="alert alert-info"> 1. Assemblage tables 'SERVICE' </div>

In [4]:
# import table service POLICE
table_service_police = pd.read_csv('fichiersPourImportSQL/export_services_police.csv')

# import table service GENDARMERIE
table_service_gendarmerie = pd.read_csv('fichiersPourImportSQL/export_services_gendarmerie.csv')

In [9]:
table_service_police.head()

  numDep               nomService  idDirection  idAdm
0     01      DIDPAF PREVESSIN 01            1      1
1     01  CIAT DE BOURG EN BRESSE            2      1
2     01           CIAT D'OYONNAX            2      1
3     02  CIAT DE CHATEAU THIERRY            2      1
4     02             CIAT DE LAON            2      1

In [10]:
len(table_service_police)

814

In [11]:
table_service_gendarmerie.head()

  numDep           nomService  idDirection  idAdm
0     01           CGD BELLEY          NaN      2
1     01  CGD BOURG EN BRESSE          NaN      2
2     01              CGD GEX          NaN      2
3     01          CGD TREVOUX          NaN      2
4     02  CGD CHATEAU THIERRY          NaN      2

In [12]:
table_service_gendarmerie.idDirection=0

In [13]:
len(table_service_gendarmerie)

395

In [14]:
table_service_PG = pd.concat([table_service_police,table_service_gendarmerie])

In [15]:
table_service_PG.tail()

    numDep                       nomService  idDirection  idAdm
390     44            CGD ANCENIS ST GEREON            0      2
391     53  CGD CHATEAU GONTIER SUR MAYENNE            0      2
392     91           CGD EVRY COURCOURONNES            0      2
393    987        CGD LES ARCHIPELS PAPEETE            0      2
394    987        CGD LES ILES DU VENT FAAA            0      2

In [16]:
len(table_service_PG)

1209

In [12]:
#export csv sans colonne id car auto incremente
table_service_PG.to_csv('fichiersPourImportSQL/export_services_PG.csv',
                       index=False)

In [17]:
# creéation colonne id pour merge avec table pointage
table_service_PG['idService']=[n for n in range(1, len(table_service_PG)+1)]

In [18]:
table_service_PG.head()

  numDep               nomService  idDirection  idAdm  idService
0     01      DIDPAF PREVESSIN 01            1      1          1
1     01  CIAT DE BOURG EN BRESSE            2      1          2
2     01           CIAT D'OYONNAX            2      1          3
3     02  CIAT DE CHATEAU THIERRY            2      1          4
4     02             CIAT DE LAON            2      1          5

## <div class="alert alert-info"> 1. Assemblage tables 'POINTAGE' </div>

In [3]:
# import table POINTAGE POLICE
table_pointage_police = pd.read_csv('fichiersPourImportSQL/export_pointage_police.csv')

# import table POINTAGE GENDARMERIE
table_pointage_gendarmerie = pd.read_csv('fichiersPourImportSQL/export_pointage_gendarmerie.csv')

In [4]:
table_pointage_police.head()

   codeIndex               nomService  nbreInfractions  annee
0          1      DIDPAF PREVESSIN 01                0   2012
1          1  CIAT DE BOURG EN BRESSE                0   2012
2          1           CIAT D'OYONNAX                0   2012
3          1  CIAT DE CHATEAU THIERRY                0   2012
4          1             CIAT DE LAON                0   2012

In [5]:
table_pointage_gendarmerie.head()

   codeIndex           nomService  nbreInfractions  annee
0          1           CGD BELLEY                0   2012
1          1  CGD BOURG EN BRESSE                0   2012
2          1              CGD GEX                0   2012
3          1          CGD TREVOUX                0   2012
4          1  CGD CHATEAU THIERRY                0   2012

In [6]:
table_pointage_PG = pd.concat([table_pointage_police, table_pointage_gendarmerie])

In [22]:
table_pointage_PG.head()

   codeIndex               nomService  nbreInfractions  annee
0          1      DIDPAF PREVESSIN 01                0   2012
1          1  CIAT DE BOURG EN BRESSE                0   2012
2          1           CIAT D'OYONNAX                0   2012
3          1  CIAT DE CHATEAU THIERRY                0   2012
4          1             CIAT DE LAON                0   2012

In [19]:
table_pointage_PG_def =table_pointage_PG.merge(table_service_PG[['nomService', 'idService', 'idDirection']], 
                                   how='left', 
                                   left_on='nomService', 
                                   right_on='nomService'
                                  )

In [20]:
table_pointage_PG_def.head()

,codeIndex,nomService,nbreInfractions,annee,idService,idDirection
0,1,DIDPAF PREVESSIN 01,0,2012,1,1
1,1,CIAT DE BOURG EN BRESSE,0,2012,2,2
2,1,CIAT D'OYONNAX,0,2012,3,2
3,1,CIAT DE CHATEAU THIERRY,0,2012,4,2
4,1,CIAT DE LAON,0,2012,5,2

In [57]:
table_pointage_PG_def.to_csv('fichiersPourImportSQL/export_pointage_PG.csv',
                            columns=['annee',
                                    'nbreInfractions',
                                    'idService',
                                    'codeIndex'], index=False)